
## Plan Result




<pre><code>Plan: 8 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_api_management_subscription.et_acas_subscription
  * azurerm_api_management_user.et_api_management_user
  * azurerm_key_vault_secret.et_acas_subscription_key
  * module.api-et-acas-mgmt-product.azurerm_api_management_product.product
  * module.api-et-acas-mgmt-product.azurerm_api_management_product_group.access_control_groups[&#34;developers&#34;]
  * module.et-acas-mgmt-api.azurerm_api_management_api.api
  * module.et-acas-mgmt-api.azurerm_api_management_product_api.link_to_product[0]
  * module.mdl-et-acas-policy.azurerm_api_management_api_policy.api_policy
* Update
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_subscription.et_acas_subscription will be created
  + resource "azurerm_api_management_subscription" "et_acas_subscription" {
      + api_management_name = "cft-api-mgmt-aat"
      + display_name        = "ET SYA ACAS Subscription"
      + id                  = (known after apply)
      + primary_key         = (sensitive value)
      + product_id          = (known after apply)
      + resource_group_name = "cft-aat-network-rg"
      + secondary_key       = (sensitive value)
      + state               = "active"
      + subscription_id     = (known after apply)
      + user_id             = (known after apply)
    }

  # azurerm_api_management_user.et_api_management_user will be created
  + resource "azurerm_api_management_user" "et_api_management_user" {
      + api_management_name = "cft-api-mgmt-aat"
      + email               = "Peter.Moores@hmcts.net"
      + first_name          = "Peter"
      + id                  = (known after apply)
      + last_name           = "Moores"
      + resource_group_name = "cft-aat-network-rg"
      + state               = (known after apply)
      + user_id             = "5931a75ae4bbd512288c888c"
    }

  # azurerm_key_vault_secret.et_acas_subscription_key will be created
  + resource "azurerm_key_vault_secret" "et_acas_subscription_key" {
      + id           = (known after apply)
      + key_vault_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-sya-api-aat/providers/Microsoft.KeyVault/vaults/et-sya-api-aat"
      + name         = "etacas-subscription-key"
      + value        = (sensitive value)
      + version      = (known after apply)
    }

  # module.api-et-acas-mgmt-product.azurerm_api_management_product.product will be created
  + resource "azurerm_api_management_product" "product" {
      + api_management_name   = "cft-api-mgmt-aat"
      + approval_required     = false
      + display_name          = "et-acas"
      + id                    = (known after apply)
      + product_id            = "et-acas"
      + published             = true
      + resource_group_name   = "cft-aat-network-rg"
      + subscription_required = true
      + subscriptions_limit   = 20
    }

  # module.api-et-acas-mgmt-product.azurerm_api_management_product_group.access_control_groups["developers"] will be created
  + resource "azurerm_api_management_product_group" "access_control_groups" {
      + api_management_name = "cft-api-mgmt-aat"
      + group_name          = "developers"
      + id                  = (known after apply)
      + product_id          = "et-acas"
      + resource_group_name = "cft-aat-network-rg"
    }

  # module.et-acas-mgmt-api.azurerm_api_management_api.api will be created
  + resource "azurerm_api_management_api" "api" {
      + api_management_name   = "cft-api-mgmt-aat"
      + display_name          = "ET SYA ACAS Api"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "et-acas-api"
      + path                  = "et-sya-api"
      + protocols             = [
          + "http",
          + "https",
        ]
      + resource_group_name   = "cft-aat-network-rg"
      + revision              = "1"
      + service_url           = "http://et-sya-api-aat.service.core-compute-aat.internal"
      + soap_pass_through     = false
      + subscription_required = true
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "swagger-link-json"
          + content_value  = "https://raw.githubusercontent.com/hmcts/reform-api-docs/master/docs/specs/et-acas-api.json"
        }

      + subscription_key_parameter_names {
          + header = (known after apply)
          + query  = (known after apply)
        }
    }

  # module.et-acas-mgmt-api.azurerm_api_management_product_api.link_to_product[0] will be created
  + resource "azurerm_api_management_product_api" "link_to_product" {
      + api_management_name = "cft-api-mgmt-aat"
      + api_name            = "et-acas-api"
      + id                  = (known after apply)
      + product_id          = "et-acas"
      + resource_group_name = "cft-aat-network-rg"
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-sya-api-aat/providers/Microsoft.KeyVault/vaults/et-sya-api-aat|et-sya-api-aat"
        log_analytics_workspace_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
        name                       = "et-sya-api-aat"
        target_resource_id         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-sya-api-aat/providers/Microsoft.KeyVault/vaults/et-sya-api-aat"

        log {
            category = "AuditEvent"
            enabled  = true

            retention_policy {
                days    = 14
                enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

  # module.mdl-et-acas-policy.azurerm_api_management_api_policy.api_policy will be created
  + resource "azurerm_api_management_api_policy" "api_policy" {
      + api_management_name = "cft-api-mgmt-aat"
      + api_name            = "et-acas-api"
      + id                  = (known after apply)
      + resource_group_name = "cft-aat-network-rg"
      + xml_content         = <<~EOT
            <policies>
                <backend>
                    <base/>
                </backend>
                <inbound>
                    <base/>
                    <!-- generate totp -->
                    <set-variable name="client_id" value="Test" />
                    <set-variable name="client_secret" value="74EEA77A5ABQMYF5" />
                    <set-variable name="one_time_password" value="@{
                            const string Base32AllowedCharacters = "ABCDEFGHIJKLMNOPQRSTUVWXYZ234567";
                            var bits = "74EEA77A5ABQMYF5".ToUpper().ToCharArray().Select(c => Convert.ToString(Base32AllowedCharacters.IndexOf(c), 2).PadLeft(5, '0')).Aggregate((a, b) => a + b);
                    var secretKeyBytes = Enumerable.Range(0, bits.Length / 8).Select(i => Convert.ToByte(bits.Substring(i * 8, 8), 2)).ToArray();
            
                    var unixTimestamp = (long) (DateTime.UtcNow.Subtract(new DateTime(1970, 1, 1))).TotalSeconds;
                    var timeIndex = unixTimestamp / 30;
                    byte[] challenge = BitConverter.GetBytes(timeIndex);
                    if (BitConverter.IsLittleEndian) {
                    Array.Reverse(challenge);
                    }
            
                    HMACSHA1 hmac = new HMACSHA1(secretKeyBytes);
                    byte[] hash = hmac.ComputeHash(challenge);
                    int offset = hash[19] & 0xf;
                    int truncatedHash = hash[offset] & 0x7f;
                    for (int i = 1; i < 4; i++)
                    {
                    truncatedHash <<= 8;
                    truncatedHash |= hash[offset + i] & 0xff;
                    }
                    truncatedHash %= 1000000;
                    return truncatedHash.ToString("D6");
                    }"/>
                    <send-request ignore-error="false" timeout="20" response-variable-name="s2sBearerToken" mode="new">
                        <set-url>http://rpe-service-auth-provider-aat.service.core-compute-aat.internal/lease</set-url>
                        <set-method>POST</set-method>
                        <set-header name="Content-Type" exists-action="override">
                            <value>application/json</value>
                        </set-header>
                        <set-body>@{
                            return new JObject(
                            new JProperty("microservice", (string)context.Variables["client_id"]),
                            new JProperty("oneTimePassword", (string)context.Variables["one_time_password"])
                            ).ToString();
                            }</set-body>
                    </send-request>
            
                    <set-header name="ServiceAuthorization" exists-action="override">
                        <value>@("Bearer " + ((IResponse)context.Variables["s2sBearerToken"]).Body.As<string>())</value>
                    </set-header>
                </inbound>
                <outbound>
                    <base/>
                </outbound>
                <on-error>
                    <base/>
                </on-error>
            </policies>
        EOT
    }

Plan: 8 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":123,"Program":"tfcmt","SHA1":"","Vars":{}} -->